{
    "name": "Agung Prakasya",
    "birth": {
        "date": "1975-05-20",
        "city": "Ciamis"
    },
    "nationality": "Indonesia",
    "contact": {
        "email": "aprksy@gmail.com",
        "phone": "+62 8197519750",
        "messaging": [
            {
                "name": "whatsapp",
                "url": "https://wa.me/628197519750",
                "label": "+62 8197519750"
            },
            {
                "name": "telegram",
                "url": "https://t.me/aprksy",
                "label": "aprksy"
            }
        ],
        "address": {
            "city": "Jakarta",
            "timezone": "Asia/Jakarta",
            "utc_offset": 7,
            "country": "Indonesia"
        }
    },
    "social_links": [
        {
            "name": "website",
            "url": "https://aprksy.xyz",
            "label": "aprksy.xyz"
        },
        {
            "name": "blog",
            "url": "https://blog.aprksy.xyz",
            "label": "blog.aprksy.xyz"
        },
        {
            "name": "resume",
            "url": "https://resume.aprksy.xyz",
            "label": "resume.aprksy.xyz"
        },
        {
            "name": "linkedin",
            "url": "https://linkedin.com/in/agungprakasya",
            "label": "linkedin.com/in/agungprakasya"
        },
        {
            "name": "github",
            "url": "https://github.com/aprksy",
            "label": "github.com/aprksy"
        },
        {
            "name": "twitter",
            "url": "https://twitter.com/aprksy",
            "label": "@aprksy"
        }
    ],
    "education": [
        {
            "level": "Degree",
            "major": "Mathematics",
            "subject": "Computational Mathematics",
            "institution": "Bandung Institute of Technology",
            "start": "1993",
            "end": "2000",
            "grade": 2.66,
            "max_grade": 4
        }
    ],
    "summary": "23 Years of total experience; 23+ years of coding in various languages; 8 years in bigdata and data-streams; 11 years of experience in energy and other industries —mostly on engeering, solution architect & specialist position;",
    "skills": [
        {
            "type": "Programming",
            "language": "Go",
            "since": 2017,
            "year_experience": 6,
            "confidence_level": 9
        }
    ],
    "qualification_statements": [
        "Highly analytical math graduate with a systematic problem-solving approach. A collaborative team player, adept at building engagement through a personal approach and trust, fostering a cohesive and productive working environment.",
        "Skilled in Linux command line, leveraging standard tools for rapid prototyping and idea validation before creating full-fledged solutions. A polyglot coder with proficiency in Go, C++, Object Pascal, Python, and Javascript, complemented by some experience in PHP, Java, and Flutter.",
        "Enthusiastic about continuous learning and currently expanding coding skills to include Rust, Elixir, Vlang, and other languages, staying at the forefront of emerging technologies."
    ],
    "career_objective": [
        "Seeking a challenging role that leverages my strong analytical and coding skills, allowing me to collaborate within a dynamic team and contribute to innovative projects. Passionate about embracing emerging technologies and continuously enhancing technical expertise. Aspiring to make a positive impact by delivering effective solutions and driving excellence through disciplined problem-solving."
    ],
    "personal_research": [
        "I am currently developing a robust Go library for Extended Petrinets, harnessing the full potential of petrinets as a formal method for comprehensive modeling in various computing scenarios; Conducting an ongoing Proof of Concept for a High-Performance Toolset Architecture tailored to handle Massive Text Data (implemented in C++);"
    ],
    "experience": [
        {
            "start": "2022-06",
            "end": "",
            "employment_type": "full-time",
            "work_environment": "Fully Remote",
            "company": "Quipper",
            "company_description": "Quipper is an education technology company that provides e-Learning, coaching, tutoring, and assessment services for K-12 in Japan, Indonesia, the Philippines, and Mexico. The company's primary service is an online learning management system, which is used in different ways in each country where it operates.",
            "positions": ["Solution Architect"],
            "report_to": "Lead Solution Architect",
            "team": [],
            "technologies": [
                "Go",
                "React",
                "MongoDB",
                "Docker",
                "Kubernetes"
            ],
            "standards": [
                {
                    "name": "OpenID",
                    "url": "https://openid.org/"
                },
                {
                    "name": "JWT",
                    "url": "https://jwt.io/"
                },
                {
                    "name": "LTI 1.3",
                    "url": "https://www.imsglobal.org/spec/lti/v1p3"
                }
            ],
            "responsibilities": [
                "Conduct solution and architecture design and review for pre-development process.",
                "Assess and analyze current system for potential improvements.",
                "Conduct PoCs for technical initiatives.",
                "Conduct initial development process before handed over to development team."
            ],
            "accomplishments": [
                "Designed and developed a LTI 1.3 Core specification implementation in Golang from the ground up.",
                "Designed an integration model for a new service with minimal impact on the existing system.",
                "Conducted knowledge sharing sessions and documentation on best practices and lessons learned in implementing standards and specifications"
            ],
            "achievements": []
        },
        {
            "start": "2021-02",
            "end": "2022-06",
            "employment_type": "full-time",
            "work_environment": "Remote",
            "company": "Paques",
            "company_description": "Paques is a prominent player in the Indonesian Big Data industry, offering top-notch Data Lake and Analytical solutions. The company excels at processing vast amounts of data, both unstructured and structured, with remarkable speed. Additionally, Paques stands out as an Open-Platform solution, seamlessly interfacing with other Best-In-Class big data platforms for enhanced functionality and versatility.",
            "positions": ["Solution Architect", "Technical PM"],
            "report_to": "CEO",
            "team": ["6 Person", "Third Party"],
            "technologies": [
                "Go",
                "Angular",
                "NodeJs",
                "Gnu Tools",
                "PostgreGIS",
                "Redis",
                "Tile38",
                "LXC"
            ],
            "standards": [
                {
                    "name": "IPDR",
                    "url": "https://en.wikipedia.org/wiki/Internet_Protocol_Detail_Record"
                },
                {
                    "name": "CDR",
                    "url": "https://en.wikipedia.org/wiki/Call_detail_record"
                },
                {
                    "name": "Geohash",
                    "url": "https://en.wikipedia.org/wiki/Geohash"
                },
                {
                    "name": "Shapefile",
                    "url": "https://en.wikipedia.org/wiki/Shapefile"
                }
            ],
            "responsibilities": [
                "Conduct solution and architecture design and review for pre-development process.",
                "Reengineered product architecture to support future growth and expansion.",
                "Demonstrate the viability of solutions offered to customers through PoCs.",
                "Collaborate with stakeholders to ensure that technical aspects of projects are aligned with their needs."
            ],
            "accomplishments": [
                "Successfully managed the technical aspects of 3 projects, resulting in on-time and within budget delivery.",
                "Reengineered 1 product, Paques Media Intelligence, from the architecture to the implementation.",
                "Architected and developed a geospatial processing pipeline from end-to-end, from the processing pipeline to the frontend dashboards.",
                "Developed and deployed a custom Go processing engine that processed 80TB in average, of compressed raw text metadata from telco operations daily."
            ],
            "achievements": [
                "2021 mid-year best employee.",
                "Nominated for 2021 best employee."
            ]
        },
        {
            "start": "2017-12",
            "end": "2021-01",
            "employment_type": "full-time",
            "work_environment": "Hybrid",
            "company": "Sibernetik",
            "company_description": "Sibernetik is a pioneering provider of Stream-based Bigdata solutions in Indonesia, leveraging cutting-edge technologies such as Confluent Kafka, Elastic stack, and Qlik. Additionally, the company offers its own proprietary industrial surveillance product, specializing in vessel and aviation tracking, among other applications.",
            "positions": ["Solution Architect", "Technical PM"],
            "report_to": "CEO",
            "team": ["5 Person", "Third Party"],
            "technologies": [
                "Go",
                "React",
                "PostgreGIS",
                "Docker",
                "PHP"
            ],
            "standards": [
                {
                    "name": "NIST",
                    "url": "https://www.nist.gov/system/files/documents/itl/ansi/Approved-Std-20070427-2.pdf"
                },
                {
                    "name": "AIS",
                    "url": "https://en.wikipedia.org/wiki/Automatic_identification_system"
                }
            ],
            "responsibilities": [
                "Conduct solution and architecture design and review for pre-development process.",
                "Demonstrate the viability of solutions offered to customers through PoCs.",
                "Collaborate with stakeholders to ensure that technical aspects of projects are aligned with their needs.",
                "Expertly mentoring and grooming a team of young engineers, preparing them for successful project and product development."
            ],
            "accomplishments": [
                "Managed technical aspects 4 projects.",
                "Designed and orchestrated the development of a robust, scalable product for implementation by the engineering team."
            ],
            "achievements": [
                "Effectively mentored and empowered a team of young engineers, culminating in the successful delivery of a high-quality product."
            ]
        },
        {
            "start": "2015-08",
            "end": "2017-12",
            "employment_type": "full-time",
            "work_environment": "Onsite",
            "company": "Dattabot",
            "company_description": "Dattabot pioneers the field of Bigdata analytics with a specialized focus on data integration technology. The company leverages cutting-edge technologies such as the Apache Hadoop ecosystem, Cassandra, and Talend. Its suite of services empowers businesses to extract valuable insights and uncover hidden information from their data, beyond the capabilities of regular analytics.",
            "positions": ["Senior Engineer"],
            "report_to": "Engineering Manager",
            "team": ["2 Person", "Internships"],
            "technologies": [
                "Go",
                "NodeJs",
                "Python",
                "Hadoop Ecosystem",
                "Talend"
            ],
            "standards": [],
            "responsibilities": [
                "Conduct solution and architecture design and review for pre-development process.",
                "Conduct technical problem solving for product and project engineering teams.",
                "Demonstrate the viability of solutions offered to customers through PoCs.",
                "Collaborate with stakeholders to ensure that technical aspects of projects are aligned with their needs.",
                "Expertly mentoring and grooming a team of young engineers, preparing them for successful project and product development."
            ],
            "accomplishments": [
                "Contributed to the successful implementation of 3 cutting-edge Big Data and IoT projects by actively collaborating on the discovery and implementation of innovative technical solutions for the company.",
                "Played a key role in shaping the company's Big Data and IoT business strategy, leveraging technical expertise and market insights to drive impactful decision-making and business growth."
            ],
            "achievements": []
        },
        {
            "start": "2015-05",
            "end": "2017-05",
            "employment_type": "full-time",
            "work_environment": "Hybrid",
            "company": "Dowedo",
            "company_description": "Dowedo was an ambitious early-stage startup in the tourism traveling packages marketplace. Although we successfully validated the idea, an in-depth post-MVP market study led us to make the difficult decision to pursue an exit strategy.",
            "positions": ["CTO", "Co-founder"],
            "report_to": "CEO",
            "team": ["3 Person"],
            "technologies": [
                "Go",
                "React",
                "NodeJs",
                "PostgreSQL"
            ],
            "standards": [],
            "responsibilities": [
                "Conducting comprehensive research to align technology, resources, and costs with our business goals and financial capacity.",
                "Leading the initial engineering team building for developing the Minimum Viable Product (MVP).",
                "Undertaking technology research to establish roadmaps, define milestones, and prioritize development efforts."
            ],
            "accomplishments": [
                "Successfully launched the Minimum Viable Product (MVP)."
            ],
            "achievements": []
        },
        {
            "start": "2013-10",
            "end": "2015-07",
            "employment_type": "full-time",
            "work_environment": "Onsite",
            "company": "Tripatra",
            "company_description": "Tripatra is a well-established and reputable integrated engineering, procurement, and construction (EPC) company based in Indonesia. With extensive expertise in project management and operation & maintenance (O&M) services, Tripatra offers comprehensive solutions for various industries. They are committed to delivering high-quality services, focusing on safety, sustainability, and innovation to meet their clients' needs. As a leading EPC player, Tripatra continues to contribute significantly to Indonesia's industrial development and economic growth.",
            "positions": ["Senior Engineer", "Analyst"],
            "report_to": "Project Control Manager",
            "team": ["Third Party"],
            "technologies": [
                "Javascript", "dot NET", "Ms SharePoint", "Ms SQL Server"
            ],
            "standards": [],
            "responsibilities": [
                "Led the solution design process to create user-friendly and efficient tools for clients to monitor on-going projects, ensuring enhanced project visibility and management.",
                "Solicited feedback from clients regarding the usability and effectiveness of the solutions, ensuring that their needs and preferences are taken into account.",
                "Facilitated effective communication between clients and the development team, providing valuable insights and actionable feedback for continuous improvement of the solutions.",
                "Collaborated with stakeholders to align technical aspects of projects with their specific requirements and expectations, ensuring seamless integration and successful implementation of the solutions."
            ],
            "accomplishments": [
                "Oversaw and supported the project progress monitoring tool used in the company's main projects, providing assistance to users and gathering feedback for improvements."
            ],
            "achievements": []
        },
        {
            "start": "2007-10",
            "end": "2013-08",
            "employment_type": "full-time",
            "work_environment": "Onsite",
            "company": "Sintesa",
            "company_description": "Sintesa operated as a managed IT solution provider, catering specifically to downstream oil and gas companies in the distribution field. The company offered comprehensive IT services, including hardware, software, operators, and non-core chore activities, allowing clients to focus on their core business. Unfortunately, Sintesa faced challenges when its primary client's holding company entered the competition, leading to the company's decision to cease operations.",
            "positions": ["CEO", "Founder"],
            "report_to": "",
            "team": ["60 Person"],
            "technologies": [
                "VMware Player", "Delphi", "PHP"
            ],
            "standards": [],
            "responsibilities": [
                "Conducted business outreach to relevant corporates to explore potential partnerships, collaborations, and business opportunities",
                "Developed a comprehensive business strategy for the company to align with its long-term goals, market trends, and competitive landscape.",
                "Implemented a robust monitoring system to oversee and evaluate the overall operations of the entire company, ensuring efficiency and effectiveness across various departments and processes."
            ],
            "accomplishments": [
                "Delivered comprehensive country-wide IT managed services for oil and gas distribution from 2008 to 2010.",
                "Successfully executed several industrial system integration projects utilizing OPC technology."
            ],
            "achievements": []
        },
        {
            "start": "2006-02",
            "end": "2007-08",
            "employment_type": "contract-based",
            "work_environment": "Onsite",
            "company": "KPC",
            "company_description": "KPC (Kaltim Prima Coal) is a prominent coal mining company based in Sangatta, East Kalimantan, Indonesia. As one of the largest open-pit mining operations in the world, KPC plays a pivotal role in the global coal industry. With a focus on operational excellence and sustainability, KPC extracts and supplies high-quality coal to meet both domestic and international demand. The company's commitment to safety, environmental responsibility, and community development has established it as a key player in the Indonesian mining sector, contributing to the region's economic growth and energy needs.",
            "positions": ["Consultant", "OPC Specialist"],
            "report_to": "Engineering Manager",
            "team": [],
            "technologies": [
                "C++", 
                "DCOM"
            ],
            "standards": [
                {
                    "name": "OPC",
                    "url": "https://www.opcfoundation.org/"
                },
                {
                    "name": "SOAP",
                    "url": "https://en.wikipedia.org/wiki/SOAP"
                }
            ],
            "responsibilities": [
                "Led the seamless integration between Siemens control system and Mincom ERP system, facilitating efficient data exchange and communication.",
                "Devised a robust failover mechanism to ensure uninterrupted operations in case of source system downtime, enhancing system resilience and minimizing potential disruptions.",
                "Prioritized data quality and integrity, implementing rigorous data validation and verification processes to ensure the accuracy and reliability of information consumed by the ERP system."
            ],
            "accomplishments": [
                "Successfully delivered the integration between Siemens control system and Mincom ERP system."
            ],
            "achievements": []
        },
        {
            "start": "2004-05",
            "end": "2005-12",
            "employment_type": "contract-based",
            "work_environment": "Onsite",
            "company": "Siemens",
            "company_description": "Siemens Indonesia is a leading technology company with a strong presence in the Indonesian market. As a subsidiary of Siemens AG, a global powerhouse in various industries, Siemens Indonesia offers cutting-edge solutions in electrification, automation, and digitalization. The company provides a wide range of products, systems, and services across multiple sectors, including energy, infrastructure, manufacturing, and healthcare. With a focus on innovation and sustainability, Siemens Indonesia is committed to advancing Indonesia's industrial development, improving infrastructure, and contributing to the country's economic growth.",
            "positions": ["Control System Engineer"],
            "report_to": "Engineering Manager",
            "team": [],
            "technologies": [
                "Siemens C",
                "Visual Basic",
                "Siemens Simatic S7-417 F/H", 
                "Simatic WinCC v6.0", 
                "Simatic HARDNET-IE S7 Redconnect"
            ],
            "standards": [
                {
                    "name": "OPC",
                    "url": "https://www.opcfoundation.org/"
                },
                {
                    "name": "Modbus",
                    "url": "https://modbus.org/"
                }
            ],
            "responsibilities": [
                "Designing and developing control systems: Creating and implementing control system designs for various industrial applications, ensuring they meet the project requirements and comply with industry standards.",
                "Programming and configuration: Writing code and configuring control systems software to enable automation and efficient operation of industrial processes.",
                "System integration: Integrating control systems with other components, such as sensors, actuators, and human-machine interfaces (HMIs), to create a cohesive and functional automation solution.",
                "Commissioning and testing: Conducting tests and commissioning activities to validate the functionality and performance of control systems, ensuring they meet the desired specifications.",
                "Compliance and safety: Ensuring that control system designs and implementations comply with relevant safety standards and regulations to maintain a safe working environment."
            ],
            "accomplishments": [
                "Collaborated with the project team to successfully accomplish the MRS-H251 ESD and F&G Obsolete System Revamping project at Total Indonesie."
            ],
            "achievements": []
        },
        {
            "start": "2000-01",
            "end": "2004-12",
            "employment_type": "full-time",
            "work_environment": "Onsite",
            "company": "Professional Service Provider",
            "company_description": "Rendered specialized computing-related professional services to small-sized businesses, including internet cafes, game centers, restaurants, and small to midsize buildings. Focused primarily on custom application development and integrating devices to automate tasks or enforce access restrictions.",
            "positions": ["Programmer"],
            "report_to": "",
            "team": [],
            "technologies": [
                "Borland Delphi", "Paradox DB", "MySQL", "Macromedia Flash"
            ],
            "standards": [],
            "responsibilities": [
                "Client Communication: Interacting with clients to understand project requirements, discussing project scope, and providing regular updates on progress.",
                "Software Development: Writing, testing, and maintaining code for various projects based on client specifications and industry best practices.",
                "Problem Solving: Analyzing complex technical challenges and devising effective solutions to meet project objectives.",
                "Project Planning: Creating project timelines, setting milestones, and managing project deliverables to ensure timely completion.",
                "Client Satisfaction: Ensuring client satisfaction by delivering projects that meet or exceed expectations and providing excellent customer support."
            ],
            "accomplishments": [
                "Developed and implemented customized billing applications for multiple internet cafes and game centers.",
                "Designed and deployed a comprehensive building and tenant management system for a midsize building in Jakarta.",
                "Created and launched dynamic websites and digital profiles for various local music bands.",
                "Produced interactive digital backdrops for numerous local events."
            ],
            "achievements": []
        }
    ],
    "personal_showcases": {
        "labs": [
            {"name": "OSes", "value": ["Archlinux", "FreeBSD", "Windows 10"]},
            {"name": "Shell", "value": ["zsh", "bash", "tcsh"]},
            {"name": "Env. Isolation", "value": ["LXC", "Podman", "Qemu/KVM"]}
        ],
        "dev_tools": [
            {"name": "IDEs", "value": ["VSCode", "Jupyter Lab", "Code::blocks", "Codelite"]},
            {"name": "Programming Languages", "value": ["C++", "Go", "Python", "FPC", "PHP"]},
            {"name": "Versioning", "value": ["Git", "Github"]}
        ],
        "learnings": [
            {"name": "Programming Language", "value": ["Rust", "Vlang", "Elixir", "C++17/20"]},
            {"name": "On-going Courses", "value": [
                {"title": "The NodeJs Master Class", "provider": "Pirple", "url": ""},
                {"title": "LAFF-On Programming for High Performance", "provider": "EDX", "url": ""},
                {"title": "High Performance Computing", "provider": "Udacity", "url": ""},
                {"title": "The Nuts and Bolts of OAuth 2.0", "provider": "Udemy", "url": ""}
            ]}
        ],
        "projects": [
            {"name": "Extended Petrinet Library", "value": ["C++", "Go"]},
            {"name": "TDD Boilerplate Initializer", "value": ["Python"]},
            {"name": "High-Performance Massive Text Data Processing system (PoC)", "value": ["C++"]},
            {"name": "SVG Animation Generator", "value": ["Go", "Matter.js", "Svelte.js"]}
        ]
    }
}